# taps
tap "aws/tap"
tap "garden-io/garden"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/core"
tap "jesseduffield/lazygit"
tap "pulumi/tap"
tap "TylerBrock/saw"
tap "cooklang/tap"
tap "turbot/tap"

# dev-utils
brew "agg" # asciinema to gif converter
brew "asciinema"
brew "bash" # latest bash
brew "bat" # cat aternative
brew "cmake"
brew "commitizen"
brew "coreutils"
brew "direnv" # directory based env vars
brew "dive"
brew "dockutil" # tools for managing mac dock items
brew "dua-cli" # Disk Usage Analyzer
brew "exa" # ls alternative
brew "fd" # Simple, fast and user-friendly alternative to find
brew "findutils"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-delta" # pager for git
brew "git-extras"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnutls"
brew "grep"
brew "gum" # a picker from charm
brew "htop" # htop alternative
brew "httpie" # curl alternative
brew "jesseduffield/lazygit/lazygit"
brew "jid"
brew "jless" # JSON viewer
brew "jq"
brew "jrnl"
brew "neofetch" # display system information
brew "neovim", args: ["HEAD"]
brew "peco" # Simplistic interactive filtering tool
brew "ripgrep" # grep alternative
brew "slides"
brew "ssh-copy-id" # Add a public key to a remote machine's authorized_keys file
brew "stow" # symlink farm manager
brew "svn"
brew "tmux"
brew "tmuxp" # templatize tmux sessions
brew "tree"
brew "tz" # show time in different timezones
brew "urlview" # fetch urls from text documents
brew "vale" # Editorial style guide for writing
brew "wget"
brew "wordnet"
brew "wtfutil" # a personal tui dashboard 
brew "z"
brew "zsh"

# other-utils
brew "cooklang/tap/cook" # well, it is a recipe cli
brew "mackup"
brew "pandoc" # Swiss-army knife of markup format conversion

# language tools
## bash
brew "bats-core" #bash automated testing system
brew "shellcheck" # Static analysis and lint tool, for (ba)sh scripts
## go
brew "go"
brew "golangci-lint"
## lua
brew "lua"
brew "luarocks"
brew "stylua"
## python
brew "protobuf"
brew "python"
brew "python@3"
brew "pipenv"
# brew "pantsbuild/tap/pants" #This is working directly with brew but not in brewfile
## rust
brew "rust-analyzer"
## node
brew "fnm"
## other
brew "act" # run github actions locally
brew "cue-lang/tap/cue"
brew "jenv"
brew "mono" # Cross platform, open source .NET framework

# cloud tools
brew "awscli"
brew "aws-sam-cli"
brew "azure-cli"
brew "saw" # multi-purpose tool for AWS CloudWatch Logs
brew "steampipe"

# IAC tools
brew "dagger/tap/dagger"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/waypoint"
brew "pulumi"
brew "pulumictl"

# k8s related stuff
brew "garden-cli"
brew "helm"
brew "krew"
brew "kubebuilder"
brew "kubectl"
brew "kubevela"
brew "kustomize"
brew "minikube"
