tap "aws/tap"
tap "garden-io/garden"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/core"
tap "jesseduffield/lazygit"
tap "pulumi/tap"
tap "TylerBrock/saw"
tap "cooklang/tap"

# utils
brew "bat" # cat aternative
brew "cooklang/tap/cook" # well, it is a recipe cli
brew "coreutils"
brew "dockutil" # tools for managing mac dock items
brew "dua-cli" # Disk Usage Analyzer
brew "fd" # Simple, fast and user-friendly alternative to find
brew "fzf"
brew "httpie" # curl alternative
brew "jless" # JSON viewer
brew "mackup"
brew "pandoc" # Swiss-army knife of markup format conversion
brew "peco" # Simplistic interactive filtering tool
brew "ripgrep" # grep alternative
brew "ssh-copy-id" # Add a public key to a remote machine's authorized_keys file
brew "stow" # symlink farm manager
brew "tree"
brew "wget"
brew "zsh"
brew "z"

# language tools
brew "bats-core" #bash automated testing system
brew "cue-lang/tap/cue"
brew "go"
brew "jenv"
brew "mono" # Cross platform, open source .NET framework
brew "protobuf"
brew "python"
brew "python@3"
brew "pipenv"
brew "shellcheck" # Static analysis and lint tool, for (ba)sh scripts

# development tools
brew "awscli"
brew "aws-sam-cli"
brew "azure-cli"
brew "dagger/tap/dagger"
brew "dive"
brew "golangci-lint"
brew "gh"
brew "git"
brew "git-extras"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/waypoint"
brew "jesseduffield/lazygit/lazygit"
brew "jq"
brew "neovim"
brew "pulumi"
brew "pulumictl"
brew "saw" # multi-purpose tool for AWS CloudWatch Logs
brew "svn"

# k8s related stuff
brew "garden-cli"
brew "helm"
brew "krew"
brew "kubebuilder"
brew "kubectl"
brew "kubevela"
brew "kustomize"
brew "minikube"
